; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-3-33-31)
(:domain gripper-strips)
(:objects robot1 robot2 robot3 - robot
rgripper1 lgripper1 rgripper2 lgripper2 rgripper3 lgripper3 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 room21 room22 room23 room24 room25 room26 room27 room28 room29 room30 room31 room32 room33 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 - object)
(:init
(at-robby robot1 room21)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room8)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at-robby robot3 room12)
(free robot3 rgripper3)
(free robot3 lgripper3)
(at ball1 room5)
(at ball2 room10)
(at ball3 room25)
(at ball4 room33)
(at ball5 room18)
(at ball6 room6)
(at ball7 room32)
(at ball8 room18)
(at ball9 room26)
(at ball10 room23)
(at ball11 room8)
(at ball12 room9)
(at ball13 room3)
(at ball14 room4)
(at ball15 room10)
(at ball16 room14)
(at ball17 room15)
(at ball18 room25)
(at ball19 room27)
(at ball20 room32)
(at ball21 room27)
(at ball22 room30)
(at ball23 room27)
(at ball24 room28)
(at ball25 room18)
(at ball26 room3)
(at ball27 room28)
(at ball28 room2)
(at ball29 room23)
(at ball30 room2)
(at ball31 room14)
)
(:goal
(and
(at ball1 room27)
(at ball2 room12)
(at ball3 room6)
(at ball4 room27)
(at ball5 room29)
(at ball6 room11)
(at ball7 room25)
(at ball8 room14)
(at ball9 room4)
(at ball10 room15)
(at ball11 room22)
(at ball12 room12)
(at ball13 room18)
(at ball14 room25)
(at ball15 room22)
(at ball16 room32)
(at ball17 room6)
(at ball18 room14)
(at ball19 room25)
(at ball20 room5)
(at ball21 room7)
(at ball22 room22)
(at ball23 room32)
(at ball24 room1)
(at ball25 room7)
(at ball26 room1)
(at ball27 room29)
(at ball28 room8)
(at ball29 room23)
(at ball30 room30)
(at ball31 room21)
)
)
)

; plan
1. (pick robot2 ball11 room8 lgripper2)
   deleted: (at ball11 room8) (free robot2 lgripper2)
   added: (carry robot2 ball11 lgripper2)
   goals met: 1 of 31
2. (move robot1 room21 room9)
   deleted: (at-robby robot1 room21)
   added: (at-robby robot1 room9)
   goals met: 1 of 31
3. (move robot3 room12 room9)
   deleted: (at-robby robot3 room12)
   added: (at-robby robot3 room9)
   goals met: 1 of 31
4. (move robot2 room8 room22)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room22)
   goals met: 1 of 31
5. (pick robot1 ball12 room9 lgripper1)
   deleted: (at ball12 room9) (free robot1 lgripper1)
   added: (carry robot1 ball12 lgripper1)
   goals met: 1 of 31
6. (move robot3 room9 room8)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room8)
   goals met: 1 of 31
7. (drop robot2 ball11 room22 lgripper2)
   deleted: (carry robot2 ball11 lgripper2)
   added: (at ball11 room22) (free robot2 lgripper2)
   goals met: 2 of 31
8. (move robot1 room9 room12)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room12)
   goals met: 2 of 31
9. (move robot3 room8 room6)
   deleted: (at-robby robot3 room8)
   added: (at-robby robot3 room6)
   goals met: 2 of 31
10. (drop robot1 ball12 room12 lgripper1)
   deleted: (carry robot1 ball12 lgripper1)
   added: (at ball12 room12) (free robot1 lgripper1)
   goals met: 3 of 31
11. (move robot2 room22 room7)
   deleted: (at-robby robot2 room22)
   added: (at-robby robot2 room7)
   goals met: 3 of 31
12. (pick robot3 ball6 room6 lgripper3)
   deleted: (at ball6 room6) (free robot3 lgripper3)
   added: (carry robot3 ball6 lgripper3)
   goals met: 3 of 31
13. (move robot3 room6 room11)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room11)
   goals met: 3 of 31
14. (move robot1 room12 room33)
   deleted: (at-robby robot1 room12)
   added: (at-robby robot1 room33)
   goals met: 3 of 31
15. (move robot2 room7 room10)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room10)
   goals met: 3 of 31
16. (drop robot3 ball6 room11 lgripper3)
   deleted: (carry robot3 ball6 lgripper3)
   added: (at ball6 room11) (free robot3 lgripper3)
   goals met: 4 of 31
17. (pick robot1 ball4 room33 lgripper1)
   deleted: (at ball4 room33) (free robot1 lgripper1)
   added: (carry robot1 ball4 lgripper1)
   goals met: 4 of 31
18. (pick robot2 ball2 room10 lgripper2)
   deleted: (at ball2 room10) (free robot2 lgripper2)
   added: (carry robot2 ball2 lgripper2)
   goals met: 4 of 31
19. (pick robot2 ball15 room10 rgripper2)
   deleted: (at ball15 room10) (free robot2 rgripper2)
   added: (carry robot2 ball15 rgripper2)
   goals met: 4 of 31
20. (move robot1 room33 room27)
   deleted: (at-robby robot1 room33)
   added: (at-robby robot1 room27)
   goals met: 4 of 31
21. (move robot2 room10 room22)
   deleted: (at-robby robot2 room10)
   added: (at-robby robot2 room22)
   goals met: 4 of 31
22. (move robot3 room11 room8)
   deleted: (at-robby robot3 room11)
   added: (at-robby robot3 room8)
   goals met: 4 of 31
23. (drop robot1 ball4 room27 lgripper1)
   deleted: (carry robot1 ball4 lgripper1)
   added: (at ball4 room27) (free robot1 lgripper1)
   goals met: 5 of 31
24. (drop robot2 ball15 room22 rgripper2)
   deleted: (carry robot2 ball15 rgripper2)
   added: (at ball15 room22) (free robot2 rgripper2)
   goals met: 6 of 31
25. (pick robot1 ball23 room27 rgripper1)
   deleted: (at ball23 room27) (free robot1 rgripper1)
   added: (carry robot1 ball23 rgripper1)
   goals met: 6 of 31
26. (move robot3 room8 room32)
   deleted: (at-robby robot3 room8)
   added: (at-robby robot3 room32)
   goals met: 6 of 31
27. (move robot2 room22 room12)
   deleted: (at-robby robot2 room22)
   added: (at-robby robot2 room12)
   goals met: 6 of 31
28. (move robot1 room27 room32)
   deleted: (at-robby robot1 room27)
   added: (at-robby robot1 room32)
   goals met: 6 of 31
29. (pick robot3 ball7 room32 lgripper3)
   deleted: (at ball7 room32) (free robot3 lgripper3)
   added: (carry robot3 ball7 lgripper3)
   goals met: 6 of 31
30. (drop robot2 ball2 room12 lgripper2)
   deleted: (carry robot2 ball2 lgripper2)
   added: (at ball2 room12) (free robot2 lgripper2)
   goals met: 7 of 31
31. (drop robot1 ball23 room32 rgripper1)
   deleted: (carry robot1 ball23 rgripper1)
   added: (at ball23 room32) (free robot1 rgripper1)
   goals met: 8 of 31
32. (move robot3 room32 room7)
   deleted: (at-robby robot3 room32)
   added: (at-robby robot3 room7)
   goals met: 8 of 31
33. (move robot3 room7 room25)
   deleted: (at-robby robot3 room7)
   added: (at-robby robot3 room25)
   goals met: 8 of 31
34. (move robot2 room12 room30)
   deleted: (at-robby robot2 room12)
   added: (at-robby robot2 room30)
   goals met: 8 of 31
35. (move robot1 room32 room2)
   deleted: (at-robby robot1 room32)
   added: (at-robby robot1 room2)
   goals met: 8 of 31
36. (pick robot2 ball22 room30 lgripper2)
   deleted: (at ball22 room30) (free robot2 lgripper2)
   added: (carry robot2 ball22 lgripper2)
   goals met: 8 of 31
37. (pick robot1 ball30 room2 lgripper1)
   deleted: (at ball30 room2) (free robot1 lgripper1)
   added: (carry robot1 ball30 lgripper1)
   goals met: 8 of 31
38. (pick robot1 ball28 room2 rgripper1)
   deleted: (at ball28 room2) (free robot1 rgripper1)
   added: (carry robot1 ball28 rgripper1)
   goals met: 8 of 31
39. (drop robot3 ball7 room25 lgripper3)
   deleted: (carry robot3 ball7 lgripper3)
   added: (at ball7 room25) (free robot3 lgripper3)
   goals met: 9 of 31
40. (pick robot3 ball3 room25 rgripper3)
   deleted: (at ball3 room25) (free robot3 rgripper3)
   added: (carry robot3 ball3 rgripper3)
   goals met: 9 of 31
41. (move robot1 room2 room8)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room8)
   goals met: 9 of 31
42. (move robot2 room30 room22)
   deleted: (at-robby robot2 room30)
   added: (at-robby robot2 room22)
   goals met: 9 of 31
43. (move robot3 room25 room6)
   deleted: (at-robby robot3 room25)
   added: (at-robby robot3 room6)
   goals met: 9 of 31
44. (drop robot1 ball28 room8 rgripper1)
   deleted: (carry robot1 ball28 rgripper1)
   added: (at ball28 room8) (free robot1 rgripper1)
   goals met: 10 of 31
45. (drop robot2 ball22 room22 lgripper2)
   deleted: (carry robot2 ball22 lgripper2)
   added: (at ball22 room22) (free robot2 lgripper2)
   goals met: 11 of 31
46. (drop robot3 ball3 room6 rgripper3)
   deleted: (carry robot3 ball3 rgripper3)
   added: (at ball3 room6) (free robot3 rgripper3)
   goals met: 12 of 31
47. (move robot1 room8 room30)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room30)
   goals met: 12 of 31
48. (move robot2 room22 room7)
   deleted: (at-robby robot2 room22)
   added: (at-robby robot2 room7)
   goals met: 12 of 31
49. (move robot3 room6 room3)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room3)
   goals met: 12 of 31
50. (drop robot1 ball30 room30 lgripper1)
   deleted: (carry robot1 ball30 lgripper1)
   added: (at ball30 room30) (free robot1 lgripper1)
   goals met: 13 of 31
51. (pick robot3 ball26 room3 lgripper3)
   deleted: (at ball26 room3) (free robot3 lgripper3)
   added: (carry robot3 ball26 lgripper3)
   goals met: 13 of 31
52. (pick robot3 ball13 room3 rgripper3)
   deleted: (at ball13 room3) (free robot3 rgripper3)
   added: (carry robot3 ball13 rgripper3)
   goals met: 13 of 31
53. (move robot2 room7 room5)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room5)
   goals met: 13 of 31
54. (move robot1 room30 room7)
   deleted: (at-robby robot1 room30)
   added: (at-robby robot1 room7)
   goals met: 13 of 31
55. (move robot3 room3 room18)
   deleted: (at-robby robot3 room3)
   added: (at-robby robot3 room18)
   goals met: 13 of 31
56. (pick robot2 ball1 room5 lgripper2)
   deleted: (at ball1 room5) (free robot2 lgripper2)
   added: (carry robot2 ball1 lgripper2)
   goals met: 13 of 31
57. (drop robot3 ball13 room18 rgripper3)
   deleted: (carry robot3 ball13 rgripper3)
   added: (at ball13 room18) (free robot3 rgripper3)
   goals met: 14 of 31
58. (move robot2 room5 room32)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room32)
   goals met: 14 of 31
59. (move robot1 room7 room4)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room4)
   goals met: 14 of 31
60. (move robot3 room18 room1)
   deleted: (at-robby robot3 room18)
   added: (at-robby robot3 room1)
   goals met: 14 of 31
61. (pick robot2 ball20 room32 rgripper2)
   deleted: (at ball20 room32) (free robot2 rgripper2)
   added: (carry robot2 ball20 rgripper2)
   goals met: 14 of 31
62. (pick robot1 ball14 room4 lgripper1)
   deleted: (at ball14 room4) (free robot1 lgripper1)
   added: (carry robot1 ball14 lgripper1)
   goals met: 14 of 31
63. (drop robot3 ball26 room1 lgripper3)
   deleted: (carry robot3 ball26 lgripper3)
   added: (at ball26 room1) (free robot3 lgripper3)
   goals met: 15 of 31
64. (move robot2 room32 room5)
   deleted: (at-robby robot2 room32)
   added: (at-robby robot2 room5)
   goals met: 15 of 31
65. (move robot1 room4 room7)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room7)
   goals met: 15 of 31
66. (drop robot2 ball20 room5 rgripper2)
   deleted: (carry robot2 ball20 rgripper2)
   added: (at ball20 room5) (free robot2 rgripper2)
   goals met: 16 of 31
67. (move robot3 room1 room26)
   deleted: (at-robby robot3 room1)
   added: (at-robby robot3 room26)
   goals met: 16 of 31
68. (move robot1 room7 room6)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room6)
   goals met: 16 of 31
69. (move robot2 room5 room27)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room27)
   goals met: 16 of 31
70. (pick robot3 ball9 room26 lgripper3)
   deleted: (at ball9 room26) (free robot3 lgripper3)
   added: (carry robot3 ball9 lgripper3)
   goals met: 16 of 31
71. (move robot1 room6 room25)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room25)
   goals met: 16 of 31
72. (drop robot2 ball1 room27 lgripper2)
   deleted: (carry robot2 ball1 lgripper2)
   added: (at ball1 room27) (free robot2 lgripper2)
   goals met: 17 of 31
73. (move robot3 room26 room4)
   deleted: (at-robby robot3 room26)
   added: (at-robby robot3 room4)
   goals met: 17 of 31
74. (pick robot2 ball21 room27 rgripper2)
   deleted: (at ball21 room27) (free robot2 rgripper2)
   added: (carry robot2 ball21 rgripper2)
   goals met: 17 of 31
75. (drop robot1 ball14 room25 lgripper1)
   deleted: (carry robot1 ball14 lgripper1)
   added: (at ball14 room25) (free robot1 lgripper1)
   goals met: 18 of 31
76. (pick robot1 ball18 room25 rgripper1)
   deleted: (at ball18 room25) (free robot1 rgripper1)
   added: (carry robot1 ball18 rgripper1)
   goals met: 18 of 31
77. (drop robot3 ball9 room4 lgripper3)
   deleted: (carry robot3 ball9 lgripper3)
   added: (at ball9 room4) (free robot3 lgripper3)
   goals met: 19 of 31
78. (move robot2 room27 room7)
   deleted: (at-robby robot2 room27)
   added: (at-robby robot2 room7)
   goals met: 19 of 31
79. (move robot1 room25 room7)
   deleted: (at-robby robot1 room25)
   added: (at-robby robot1 room7)
   goals met: 19 of 31
80. (drop robot2 ball21 room7 rgripper2)
   deleted: (carry robot2 ball21 rgripper2)
   added: (at ball21 room7) (free robot2 rgripper2)
   goals met: 20 of 31
81. (move robot3 room4 room27)
   deleted: (at-robby robot3 room4)
   added: (at-robby robot3 room27)
   goals met: 20 of 31
82. (move robot1 room7 room14)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room14)
   goals met: 20 of 31
83. (drop robot1 ball18 room14 rgripper1)
   deleted: (carry robot1 ball18 rgripper1)
   added: (at ball18 room14) (free robot1 rgripper1)
   goals met: 21 of 31
84. (pick robot3 ball19 room27 lgripper3)
   deleted: (at ball19 room27) (free robot3 lgripper3)
   added: (carry robot3 ball19 lgripper3)
   goals met: 21 of 31
85. (pick robot1 ball31 room14 lgripper1)
   deleted: (at ball31 room14) (free robot1 lgripper1)
   added: (carry robot1 ball31 lgripper1)
   goals met: 21 of 31
86. (move robot2 room7 room28)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room28)
   goals met: 21 of 31
87. (move robot3 room27 room25)
   deleted: (at-robby robot3 room27)
   added: (at-robby robot3 room25)
   goals met: 21 of 31
88. (move robot1 room14 room21)
   deleted: (at-robby robot1 room14)
   added: (at-robby robot1 room21)
   goals met: 21 of 31
89. (pick robot2 ball27 room28 lgripper2)
   deleted: (at ball27 room28) (free robot2 lgripper2)
   added: (carry robot2 ball27 lgripper2)
   goals met: 21 of 31
90. (pick robot2 ball24 room28 rgripper2)
   deleted: (at ball24 room28) (free robot2 rgripper2)
   added: (carry robot2 ball24 rgripper2)
   goals met: 21 of 31
91. (drop robot3 ball19 room25 lgripper3)
   deleted: (carry robot3 ball19 lgripper3)
   added: (at ball19 room25) (free robot3 lgripper3)
   goals met: 22 of 31
92. (drop robot1 ball31 room21 lgripper1)
   deleted: (carry robot1 ball31 lgripper1)
   added: (at ball31 room21) (free robot1 lgripper1)
   goals met: 23 of 31
93. (move robot2 room28 room29)
   deleted: (at-robby robot2 room28)
   added: (at-robby robot2 room29)
   goals met: 23 of 31
94. (drop robot2 ball27 room29 lgripper2)
   deleted: (carry robot2 ball27 lgripper2)
   added: (at ball27 room29) (free robot2 lgripper2)
   goals met: 24 of 31
95. (move robot1 room21 room7)
   deleted: (at-robby robot1 room21)
   added: (at-robby robot1 room7)
   goals met: 24 of 31
96. (move robot3 room25 room7)
   deleted: (at-robby robot3 room25)
   added: (at-robby robot3 room7)
   goals met: 24 of 31
97. (move robot2 room29 room1)
   deleted: (at-robby robot2 room29)
   added: (at-robby robot2 room1)
   goals met: 24 of 31
98. (move robot1 room7 room23)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room23)
   goals met: 24 of 31
99. (move robot3 room7 room15)
   deleted: (at-robby robot3 room7)
   added: (at-robby robot3 room15)
   goals met: 24 of 31
100. (drop robot2 ball24 room1 rgripper2)
   deleted: (carry robot2 ball24 rgripper2)
   added: (at ball24 room1) (free robot2 rgripper2)
   goals met: 25 of 31
101. (pick robot1 ball10 room23 lgripper1)
   deleted: (at ball10 room23) (free robot1 lgripper1)
   added: (carry robot1 ball10 lgripper1)
   goals met: 25 of 31
102. (pick robot3 ball17 room15 lgripper3)
   deleted: (at ball17 room15) (free robot3 lgripper3)
   added: (carry robot3 ball17 lgripper3)
   goals met: 25 of 31
103. (move robot1 room23 room15)
   deleted: (at-robby robot1 room23)
   added: (at-robby robot1 room15)
   goals met: 25 of 31
104. (move robot3 room15 room6)
   deleted: (at-robby robot3 room15)
   added: (at-robby robot3 room6)
   goals met: 25 of 31
105. (move robot2 room1 room14)
   deleted: (at-robby robot2 room1)
   added: (at-robby robot2 room14)
   goals met: 25 of 31
106. (drop robot1 ball10 room15 lgripper1)
   deleted: (carry robot1 ball10 lgripper1)
   added: (at ball10 room15) (free robot1 lgripper1)
   goals met: 26 of 31
107. (drop robot3 ball17 room6 lgripper3)
   deleted: (carry robot3 ball17 lgripper3)
   added: (at ball17 room6) (free robot3 lgripper3)
   goals met: 27 of 31
108. (pick robot2 ball16 room14 lgripper2)
   deleted: (at ball16 room14) (free robot2 lgripper2)
   added: (carry robot2 ball16 lgripper2)
   goals met: 27 of 31
109. (move robot2 room14 room32)
   deleted: (at-robby robot2 room14)
   added: (at-robby robot2 room32)
   goals met: 27 of 31
110. (move robot1 room15 room7)
   deleted: (at-robby robot1 room15)
   added: (at-robby robot1 room7)
   goals met: 27 of 31
111. (move robot3 room6 room29)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room29)
   goals met: 27 of 31
112. (drop robot2 ball16 room32 lgripper2)
   deleted: (carry robot2 ball16 lgripper2)
   added: (at ball16 room32) (free robot2 lgripper2)
   goals met: 28 of 31
113. (move robot3 room29 room18)
   deleted: (at-robby robot3 room29)
   added: (at-robby robot3 room18)
   goals met: 28 of 31
114. (move robot1 room7 room18)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room18)
   goals met: 28 of 31
115. (pick robot3 ball8 room18 lgripper3)
   deleted: (at ball8 room18) (free robot3 lgripper3)
   added: (carry robot3 ball8 lgripper3)
   goals met: 28 of 31
116. (pick robot3 ball5 room18 rgripper3)
   deleted: (at ball5 room18) (free robot3 rgripper3)
   added: (carry robot3 ball5 rgripper3)
   goals met: 28 of 31
117. (move robot2 room32 room7)
   deleted: (at-robby robot2 room32)
   added: (at-robby robot2 room7)
   goals met: 28 of 31
118. (pick robot1 ball25 room18 lgripper1)
   deleted: (at ball25 room18) (free robot1 lgripper1)
   added: (carry robot1 ball25 lgripper1)
   goals met: 28 of 31
119. (move robot1 room18 room7)
   deleted: (at-robby robot1 room18)
   added: (at-robby robot1 room7)
   goals met: 28 of 31
120. (move robot3 room18 room29)
   deleted: (at-robby robot3 room18)
   added: (at-robby robot3 room29)
   goals met: 28 of 31
121. (drop robot3 ball5 room29 rgripper3)
   deleted: (carry robot3 ball5 rgripper3)
   added: (at ball5 room29) (free robot3 rgripper3)
   goals met: 29 of 31
122. (drop robot1 ball25 room7 lgripper1)
   deleted: (carry robot1 ball25 lgripper1)
   added: (at ball25 room7) (free robot1 lgripper1)
   goals met: 30 of 31
123. (move robot3 room29 room14)
   deleted: (at-robby robot3 room29)
   added: (at-robby robot3 room14)
   goals met: 30 of 31
124. (drop robot3 ball8 room14 lgripper3)
   deleted: (carry robot3 ball8 lgripper3)
   added: (at ball8 room14) (free robot3 lgripper3)
   goals met: 31 of 31
